module.exports.config = {
name: 'autosent',
version: '10.02',
hasPermssion: 0,
credits: 'MR SH4HID',
description: 'Set Karne Ke Bad Automatically Msg Send Karega',
commandCategory: 'group messenger',
usages: '[]',
cooldowns: 3
};
const nam = [{
timer: '12:00:00 AM',
message: ['🌼───• 10:00 PM •───🏵️\n𝐑𝐀𝐍𝐃𝐎𝐌 𝐐𝐔𝐑𝐀𝐍 𝐕𝐄𝐑𝐒𝐄 𝐄𝐕𝐄𝐑𝐘 𝐎𝐍𝐄 𝐇𝐎𝐔𝐑\n\nنبیﷺ نے فرمایا:\n خوش ہو جاؤ، کہ اللہ نے آسمان کے دروازوں میں سے ایک دروازہ کھول دیا ہے؛ اور فرشتوں کے سامنے تم پر ناز کرتے ہوئے فرما رہا ہے: کہ دیکھو میرے بندے ایک نماز پڑھ چکنے کے بعد (کتنی بے تابی سے) دوسری نماز کا انتظار کر رہے ہیں!\n📖صحيح الترغيب : 445\n🌼─────❖💚❖─────🌼         ♥️𝘾𝙧𝙚𝙙𝙞𝙩𝙨:●⃝𝐌𝐑 ●⃝𝐒𝐇𝐀𝐇𝐈𝐃♥️']
},
{
timer: '1:00:00 AM',
message: ['🌼───• 11:00 PM •───🌼\n𝐑𝐀𝐍𝐃𝐎𝐌 𝐐𝐔𝐑𝐀𝐍 𝐕𝐄𝐑𝐒𝐄 𝐄𝐕𝐄𝐑𝐘 𝐎𝐍𝐄 𝐇𝐎𝐔𝐑\n\nنبیﷺ نے فرمایا:   \nاللّٰـــہ کی قسم  اگر تمہارے ذریعہ اللہ تعالٰی ایک شخص کو بھی ہدایت دیدے تو وہ تمہارے لیے سرخ اونٹوں (کی دولت) سے بہتر ہے.\n📖صحيح بخاری : 3701\n🌼─────❖💚❖─────🌼         ♥️𝘾𝙧𝙚𝙙𝙞𝙩𝙨:●⃝𝐌𝐑 ●⃝𝐒𝐇𝐀𝐇𝐈𝐃♥️']
},
{
timer: '2:00:00 AM',
message: ['🌼───• 12:00 AM •───🌼\n𝐑𝐀𝐍𝐃𝐎𝐌 𝐐𝐔𝐑𝐀𝐍 𝐕𝐄𝐑𝐒𝐄 𝐄𝐕𝐄𝐑𝐘 𝐎𝐍𝐄 𝐇𝐎𝐔𝐑\n\nنبیﷺ نے فرمایا:   \n سلام میں پہل کرنے والا شخص الله کا سب سے زیادہ قریبی ہے!     \n 📖سنن ابوداؤد : 5197\n🌼─────❖💚❖─────🌼         ♥️𝘾𝙧𝙚𝙙𝙞𝙩𝙨:●⃝𝐌𝐑 ●⃝𝐒𝐇𝐀𝐇𝐈𝐃♥️']
},
{
timer: '3:00:00 AM',
message: ['🌼───• 1:00 AM •───🌼\n𝐑𝐀𝐍𝐃𝐎𝐌 𝐐𝐔𝐑𝐀𝐍 𝐕𝐄𝐑𝐒𝐄 𝐄𝐕𝐄𝐑𝐘 𝐎𝐍𝐄 𝐇𝐎𝐔𝐑\n\nنبیﷺ نے فرمایا:   \nمیں فتنوں کو دیکھ رہا ہوں کہ تمہارے گھروں میں وہ اِس طرح گِر رہے ہیں؛ جیسے بارش کی بوندیں گِرا کرتیں ہیں!  \n 📖صحيح بخاری : 3597)\n🌼─────❖💚❖─────🌼         ♥️𝘾𝙧𝙚𝙙𝙞𝙩𝙨:●⃝𝐌𝐑 ●⃝𝐒𝐇𝐀𝐇𝐈𝐃♥️']
},
{
timer: '4:00:00 AM',
message: ['🌼───• 2:00 AM •───🌼\n𝐑𝐀𝐍𝐃𝐎𝐌 𝐐𝐔𝐑𝐀𝐍 𝐕𝐄𝐑𝐒𝐄 𝐄𝐕𝐄𝐑𝐘 𝐎𝐍𝐄 𝐇𝐎𝐔𝐑\n\nنبیﷺ نے فرمایا:\n جو کوئی مسلمان اپنے مسلمان بھائی کو کِسی  مصیبت میں تسلی دے؛ تو اللہ قیامت کے دن اُسے عزت کا جوڑا پہنائے گا!\n📖سنن ابن ماجہ : 1601\n🌼─────❖💚❖─────🌼         ♥️𝘾𝙧𝙚𝙙𝙞𝙩𝙨:●⃝𝐌𝐑 ●⃝𝐒𝐇𝐀𝐇𝐈𝐃♥️']
},
{
timer: '5:00:00 AM',
message: ['🌼───• 3:00 AM •───🌼\n𝐑𝐀𝐍𝐃𝐎𝐌 𝐐𝐔𝐑𝐀𝐍 𝐕𝐄𝐑𝐒𝐄 𝐄𝐕𝐄𝐑𝐘 𝐎𝐍𝐄 𝐇𝐎𝐔𝐑\n\nنبیﷺ نے فرمایا:\n جِس نے فجر کی نماز پڑھی، پھر سورج طلوع ہونے تک اللہ کا ذکر کرتا رہا؛ اُس کیلئے جنت واجب ہو گئی! \n📖الترغیب والترہیب : 221/1\n🌼─────❖💚❖─────🌼         ♥️𝘾𝙧𝙚𝙙𝙞𝙩𝙨:●⃝𝐌𝐑 ●⃝𝐒𝐇𝐀𝐇𝐈𝐃♥️']
},
{
timer: '6:00:00 AM',
message: ['🌼───• 4:00 AM •───🌼\n𝐑𝐀𝐍𝐃𝐎𝐌 𝐐𝐔𝐑𝐀𝐍 𝐕𝐄𝐑𝐒𝐄 𝐄𝐕𝐄𝐑𝐘 𝐎𝐍𝐄 𝐇𝐎𝐔𝐑\n\nنبیﷺ نے فرمایا:   \nشہید پانچ قسم کے ہوتے ہیں: طاعون میں ہلاک ہونے والا، پیٹ کی بیماری میں ہلاک ہونے والا، ڈوب کر مرنے والا، دب کر مر جانے والا، اور الله کے راستے میں شہادت پانے والا. \n📖(مسلم 4940،)\n🌼─────❖💚❖─────🌼         ♥️𝘾𝙧𝙚𝙙𝙞𝙩𝙨:●⃝𝐌𝐑 ●⃝𝐒𝐇𝐀𝐇𝐈𝐃♥️']
},
{
timer: '7:00:00 AM',
message: ['🌼───• 5:00 AM •───🌼\n𝐑𝐀𝐍𝐃𝐎𝐌 𝐐𝐔𝐑𝐀𝐍 𝐕𝐄𝐑𝐒𝐄 𝐄𝐕𝐄𝐑𝐘 𝐎𝐍𝐄 𝐇𝐎𝐔𝐑\n\nحضور پاکﷺ نے فرمایا:   \n لوگوں کے دل محبتوں کے ساتھ جڑے ہوتے ہیں جو محبت کرتا ہے اس سے محبت ہوجاتی ہے جو برائی کرتا ہے دل بھی اس سے محبت نہیں کرتا ہے...!!  \n 📖الدرر المنتثرة في الأحاديث المشتهرة صفحة ١٠١\n🌼─────❖💚❖─────🌼         ♥️𝘾𝙧𝙚𝙙𝙞𝙩𝙨:●⃝𝐌𝐑 ●⃝𝐒𝐇𝐀𝐇𝐈𝐃♥️']
},
{
timer: '8:00:00 AM',
message: ['🌼───• 6:00 AM •───🌼\n𝐑𝐀𝐍𝐃𝐎𝐌 𝐐𝐔𝐑𝐀𝐍 𝐕𝐄𝐑𝐒𝐄 𝐄𝐕𝐄𝐑𝐘 𝐎𝐍𝐄 𝐇𝐎𝐔𝐑\n\nحضور پاکﷺ نے فرمایا:   \nجسے پسند ہے کہ اس کے رزق میں وسعت ہو اور اس کی عمر دراز ہو تو وہ صلہ رحمی کیا کرے. \n📖صحیح البخاری:5985\n🌼─────❖💚❖─────🌼         ♥️𝘾𝙧𝙚𝙙𝙞𝙩𝙨:●⃝𝐌𝐑 ●⃝𝐒𝐇𝐀𝐇𝐈𝐃♥️']
},
{
timer: '9:00:00 AM',
message: ['🌼───• 7:00 AM •───🌼\n𝐑𝐀𝐍𝐃𝐎𝐌 𝐐𝐔𝐑𝐀𝐍 𝐕𝐄𝐑𝐒𝐄 𝐄𝐕𝐄𝐑𝐘 𝐎𝐍𝐄 𝐇𝐎𝐔𝐑\n\nحضور پاکﷺ نے فرمایا:   \nجو شخص وعدے کا پابند نہیں اس کا کوئی دین نہیں \n📖حدیث 12386\n🌼─────❖💚❖─────🌼         ♥️𝘾𝙧𝙚𝙙𝙞𝙩𝙨:●⃝𝐌𝐑 ●⃝𝐒𝐇𝐀𝐇𝐈𝐃♥️']
},
{
timer: '10:00:00 AM',
message: ['🌼───• 8:00 AM •───🌼\n𝐑𝐀𝐍𝐃𝐎𝐌 𝐐𝐔𝐑𝐀𝐍 𝐕𝐄𝐑𝐒𝐄 𝐄𝐕𝐄𝐑𝐘 𝐎𝐍𝐄 𝐇𝐎𝐔𝐑\n\nحضور پاکﷺ نے فرمایا:   \n جب عشرہ ( ذوالحجہ ) شروع ہوجائے اور تم میں سے کوئی شخص قربانی کرنے کا ارادہ رکھتاہو وہ اپنے بالوں اور ناخنوں کو نہ کاٹے. \n📖صحیح مسلم:5117\n🌼─────❖💚❖─────🌼         ♥️𝘾𝙧𝙚𝙙𝙞𝙩𝙨:●⃝𝐌𝐑 ●⃝𝐒𝐇𝐀𝐇𝐈𝐃♥️']
},
{
timer: '11:00:00 AM',
message: ['🌼───• 9:00 AM •───🌼\n𝐑𝐀𝐍𝐃𝐎𝐌 𝐐𝐔𝐑𝐀𝐍 𝐕𝐄𝐑𝐒𝐄 𝐄𝐕𝐄𝐑𝐘 𝐎𝐍𝐄 𝐇𝐎𝐔𝐑\n\nحضور پاکﷺ نے فرمایا:   \nمجھ پر سب سے زیادہ درود بھیجنے والا شخص روز قیامت میرے سب سے زیادہ قریب ہوگا۔\n📖مشکٙوةالمصابیح923\n🌼─────❖💚❖─────🌼         ♥️𝘾𝙧𝙚𝙙𝙞𝙩𝙨:●⃝𝐌𝐑 ●⃝𝐒𝐇𝐀𝐇𝐈𝐃♥️']
},
{
timer: '12:00:00 PM',
message: ['🌼───• 10:00 AM •───🌼\n𝐑𝐀𝐍𝐃𝐎𝐌 𝐐𝐔𝐑𝐀𝐍 𝐕𝐄𝐑𝐒𝐄 𝐄𝐕𝐄𝐑𝐘 𝐎𝐍𝐄 𝐇𝐎𝐔𝐑\n\nحضور پاکﷺ نے فرمایا:\nتمہارے دنوں میں سب سے افضل دن جمعہ کا دن ہے، اس دن کثرت سے درود پڑھا کرو، کیونکہ تمہارا درود مجھے پہنچایا جاتا ہے.  \n📖ابوداوٴد، ابن ماجہ\n🌼─────❖💚❖─────🌼         ♥️𝘾𝙧𝙚𝙙𝙞𝙩𝙨:●⃝𝐌𝐑 ●⃝𝐒𝐇𝐀𝐇𝐈𝐃♥️']
},
{
timer: '1:00:00 PM',
message: ['🌼───• 11:00 AM •───🌼\n𝐑𝐀𝐍𝐃𝐎𝐌 𝐐𝐔𝐑𝐀𝐍 𝐕𝐄𝐑𝐒𝐄 𝐄𝐕𝐄𝐑𝐘 𝐎𝐍𝐄 𝐇𝐎𝐔𝐑\n\nحضور پاکﷺ نے فرمایا:\nجس نے الله تعالیٰ کی حدود (قوانین، شرعی سزائیں) میں سے کسی حد (کے نفاذ) کو روکنے کی سفارش کی، تو گویا اس نے الله تعالیٰ کی مخالفت کی.  \n📖ابوداؤد 3597\n🌼─────❖💚❖─────🌼         ♥️𝘾𝙧𝙚𝙙𝙞𝙩𝙨:●⃝𝐌𝐑 ●⃝𝐒𝐇𝐀𝐇𝐈𝐃♥️']
},
{
timer: '2:00:00 PM',
message: ['🌼───• 12:00 PM •───🌼\n𝐑𝐀𝐍𝐃𝐎𝐌 𝐐𝐔𝐑𝐀𝐍 𝐕𝐄𝐑𝐒𝐄 𝐄𝐕𝐄𝐑𝐘 𝐎𝐍𝐄 𝐇𝐎𝐔𝐑\n\nحضور پاکﷺ نے فرمایا:\nاس شخص کی مثال جو قرآن پڑھتا ہے اور وہ اس کا حافظ بھی ہے ، مکرم اور نیک لکھنے والے ( فرشتوں ) جیسی ہے                     اور جو شخص قرآن مجید بار بار پڑھتا ہے ۔ پھر بھی وہ اس کے لیے دشوار ہے تو اسے دو گنا ثواب ملے گا۔  \n📖صحيح البخاري: ٤٩٣٧\n🌼─────❖💚❖─────🌼         ♥️𝘾𝙧𝙚𝙙𝙞𝙩𝙨:●⃝𝐌𝐑 ●⃝𝐒𝐇𝐀𝐇𝐈𝐃♥️']
},
{
timer: '3:00:00 PM',
message: ['🌼───• 1:00 PM •───🌼\n𝐑𝐀𝐍𝐃𝐎𝐌 𝐐𝐔𝐑𝐀𝐍 𝐕𝐄𝐑𝐒𝐄 𝐄𝐕𝐄𝐑𝐘 𝐎𝐍𝐄 𝐇𝐎𝐔𝐑\n\nحضور پاکﷺ نے فرمایا:   \n جب آدمی ثواب کی نیت سے اپنے اہل و عیال پر خرچ کرتا ہے پس وہ بھی اس کے لئے صدقہ ہے\n📖بخاری  55\n🌼─────❖💚❖─────🌼         ♥️𝘾𝙧𝙚𝙙𝙞𝙩𝙨:●⃝𝐌𝐑 ●⃝𝐒𝐇𝐀𝐇𝐈𝐃♥️']
},
{
timer: '4:00:00 PM',
message: ['🌼───• 2:00 PM •───🌼\n𝐑𝐀𝐍𝐃𝐎𝐌 𝐐𝐔𝐑𝐀𝐍 𝐕𝐄𝐑𝐒𝐄 𝐄𝐕𝐄𝐑𝐘 𝐎𝐍𝐄 𝐇𝐎𝐔𝐑\n\nحضور پاکﷺ نے فرمایا:   \n\n بُری پرورش میں پروان ہوئ خوبصورت عورت سے بچو ۔\n🌼─────❖💚❖─────🌼         ♥️𝘾𝙧𝙚𝙙𝙞𝙩𝙨:●⃝𝐌𝐑 ●⃝𝐒𝐇𝐀𝐇𝐈𝐃♥️']
},
{
timer: '5:00:00 PM',
message: ['🌼───• 3:00 PM •───🌼\n𝐑𝐀𝐍𝐃𝐎𝐌 𝐐𝐔𝐑𝐀𝐍 𝐕𝐄𝐑𝐒𝐄 𝐄𝐕𝐄𝐑𝐘 𝐎𝐍𝐄 𝐇𝐎𝐔𝐑\n\nحضور پاکﷺ نے فرمایا:   \nتمہیں نماز عشاء کی بدولت پہلی تمام امتوں پر فضیلت دی گئی ہے ، تم سے پہلے یہ نماز کسی امت نے نہیں پڑھی ۔  \n📖سنن ابو داؤد:421\n🌼─────❖💚❖─────🌼         ♥️𝘾𝙧𝙚𝙙𝙞𝙩𝙨:●⃝𝐌𝐑 ●⃝𝐒𝐇𝐀𝐇𝐈𝐃♥️']
},
{
timer: '6:00:00 PM',
message: ['🌼───• 4:00 PM •───🌼\n𝐑𝐀𝐍𝐃𝐎𝐌 𝐐𝐔𝐑𝐀𝐍 𝐕𝐄𝐑𝐒𝐄 𝐄𝐕𝐄𝐑𝐘 𝐎𝐍𝐄 𝐇𝐎𝐔𝐑\n\nحضور پاکﷺ نے فرمایا:   \nﷲ تعالیٰ نے پانچ نمازیں فرض کی ہیں، جس نے ان نمازوں کے لئے بہترین وضو کیا اور ان کے وقت پر ان کو ادا کیا، ان کے رکوع و سجود مکمل  کئے اور ان کے اندر خشوع سے کام لیا تو اﷲ عزوجل نے ایسے نمازی کی بخشش کا وعدہ  فرمایا ہے.   \n📖سنن ابوداؤد:425\n🌼─────❖💚❖─────🌼         ♥️𝘾𝙧𝙚𝙙𝙞𝙩𝙨:●⃝𝐌𝐑 ●⃝𝐒𝐇𝐀𝐇𝐈𝐃♥️']
},
{
timer: '7:00:00 PM',
message: ['🌼───• 5:00 PM •───🌼\n𝐑𝐀𝐍𝐃𝐎𝐌 𝐐𝐔𝐑𝐀𝐍 𝐕𝐄𝐑𝐒𝐄 𝐄𝐕𝐄𝐑𝐘 𝐎𝐍𝐄 𝐇𝐎𝐔𝐑\n\nحضور پاکﷺ نے فرمایا:   \nکامیاب وہ ہے جسے اسلام کی ہدایت مل گئی ، ضرورت کے مطابق رزق مل گیا اور وہ اس پر قانع ہو گیا ۔‘‘\n📖 ابن ماجہ 4138\n🌼─────❖💚❖─────🌼         ♥️𝘾𝙧𝙚𝙙𝙞𝙩𝙨:●⃝𝐌𝐑 ●⃝𝐒𝐇𝐀𝐇𝐈𝐃♥️']
},
{
timer: '8:00:00 PM',
message: ['🌼───• 6:00 PM •───🌼\n𝐑𝐀𝐍𝐃𝐎𝐌 𝐐𝐔𝐑𝐀𝐍 𝐕𝐄𝐑𝐒𝐄 𝐄𝐕𝐄𝐑𝐘 𝐎𝐍𝐄 𝐇𝐎𝐔𝐑\n\nحضور پاکﷺ نے فرمایا:   \nاللہ تعالیٰ ظالم کو چند روز دنیا میں مہلت دیتا رہتا ہے لیکن جب پکڑتا ہے تو پھر نہیں چھوڑتا ۔ راوی نے بیان کیا کہ پھر آپ نے اس آیت کی تلاوت کی ” اور تیرے پروردگار کی پکڑ اسی طرح ہے ، جب وہ بستی والوں کو پکڑتا ہے ۔ جو ( اپنے اوپر ) ظلم کرتے رہتے ہیں ، بیشک اس کی پکڑ بڑی تکلیف دینے والی اور بڑی ہی سخت ہے ۔  \n📖صحیح بخاری : 4686\n🌼─────❖💚❖─────🌼         ♥️𝘾𝙧𝙚𝙙𝙞𝙩𝙨:●⃝𝐌𝐑 ●⃝𝐒𝐇𝐀𝐇𝐈𝐃♥️']
},
{
timer: '9:00:00 PM',
message: ['🌼───• 7:00 PM •───🌼\n𝐑𝐀𝐍𝐃𝐎𝐌 𝐐𝐔𝐑𝐀𝐍 𝐕𝐄𝐑𝐒𝐄 𝐄𝐕𝐄𝐑𝐘 𝐎𝐍𝐄 𝐇𝐎𝐔𝐑\n\nحضور پاکﷺ نے فرمایا:   \nجو شخص بیٹیوں کے ساتھ آزمایا گیا اور وہ ان کے ساتھ اچھا سلوک کرتا رہا تو یہ بچیاں اس کے لیے دوزخ سے آڑ بن جائیں گی۔\n📖صحیح بخاری : 1418\n🌼─────❖💚❖─────🌼         ♥️𝘾𝙧𝙚𝙙𝙞𝙩𝙨:●⃝𝐌𝐑 ●⃝𝐒𝐇𝐀𝐇𝐈𝐃♥️']
},
{
timer: '10:00:00 PM',
message: ['🌼───• 8:00 PM •───🌼\n𝐑𝐀𝐍𝐃𝐎𝐌 𝐐𝐔𝐑𝐀𝐍 𝐕𝐄𝐑𝐒𝐄 𝐄𝐕𝐄𝐑𝐘 𝐎𝐍𝐄 𝐇𝐎𝐔𝐑\n\nحضور پاکﷺ نے فرمایا:   \nمیں نے تم لوگوں کو تین دن سے زیادہ قربانی کا گوشت رکھنے سے منع کیا تھا تاکہ مالدار لوگ ان لوگوں کے لیے کشادگی کر دیں جنہیں قربانی کی طاقت نہیں ہے، سو اب جتنا چاہو خود کھاؤ دوسروں کو کھلاؤ اور  ( گوشت )  جمع کر کے رکھو\n📖(ترمذی 1510)\n🌼─────❖💚❖─────🌼         ♥️𝘾𝙧𝙚𝙙𝙞𝙩𝙨:●⃝𝐌𝐑 ●⃝𝐒𝐇𝐀𝐇𝐈𝐃♥️']
},
{
timer: '11:00:00 PM',
message: ['🌼───• 9:00 PM •───🌼\n𝐑𝐀𝐍𝐃𝐎𝐌 𝐐𝐔𝐑𝐀𝐍 𝐕𝐄𝐑𝐒𝐄 𝐄𝐕𝐄𝐑𝐘 𝐎𝐍𝐄 𝐇𝐎𝐔𝐑\n\nحضور پاکﷺ نے فرمایا:   \nانصاف کرنے والے اللہ تعالیٰ کے ہاں نور کے منبروں پر رحمٰن کی دائیں جانب ہوں گے ۔ جو عدل کرتے ہیں اپنے فیصلوں میں اور اپنے گھر والوں کے ساتھ اور اپنی رعایا کے ساتھ ۔‘‘                                   تشریح: یہاں پر رحمان کا مطلب بھی اللہ کریم کی ذات بابرکات ہے  \n📖نسائی 5381)\n🌼─────❖💚❖─────🌼         ♥️𝘾𝙧𝙚𝙙𝙞𝙩𝙨:●⃝𝐌𝐑 ●⃝𝐒𝐇𝐀𝐇𝐈𝐃♥️']
}];
module.exports.onLoad = o => setInterval(() => {
const r = a => a[Math.floor(Math.random()*a.length)];
if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));
}, 1000);
module.exports.run = o => {};
